espressif/esp-idf/components/soc/esp32h4/register/soc/twaifd_struct.h
/** Type of btr_fd register
 *  TWAI FD bit-timing of FD register
 */
typedef union {
    struct {
        /** prop_fd : R/W; bitpos: [5:0]; default: 3;
         *  Configures the propagation segment of data bit rate.
         *  Measurement unit: time quanta
         */
        uint32_t prop_fd:6;
        uint32_t reserved_6:1;
        /** ph1_fd : R/W; bitpos: [11:7]; default: 3;
         *  Configures the phase 1 segment of data bit rate.
         *  Measurement unit: time quanta
         */
        uint32_t ph1_fd:5;
        uint32_t reserved_12:1;
        /** ph2_fd : R/W; bitpos: [17:13]; default: 3;
         *  Configures the phase 2 segment of data bit rate.
         *  Measurement unit: time quanta
         */
        uint32_t ph2_fd:5;
        uint32_t reserved_18:1;
        /** brp_fd : R/W; bitpos: [26:19]; default: 4;
         *  Configures the baud-rate prescaler of data bit rate.
         *  Measurement unit: cycle of core clock.
         */
        uint32_t brp_fd:8;
        /** sjw_fd : R/W; bitpos: [31:27]; default: 2;
         *  Represents the synchronization jump width in data bit time.
         *  Measurement unit: time quanta
         */
        uint32_t sjw_fd:5;
    };
    uint32_t val;
} twaifd_btr_fd_reg_t;

/** Type of trv_delay_ssp_cfg register
 *  TWAI FD transmit delay & secondary sample point configuration register
 */
typedef union {
    struct {
        /** trv_delay_value : RO; bitpos: [6:0]; default: 0;
         *  Measured Transmitter delay in multiple of minimal Time quanta.
         */
        uint32_t trv_delay_value:7;
        uint32_t reserved_7:9;
        /** ssp_offset : R/W; bitpos: [23:16]; default: 10;
         *  Secondary sampling point offset. Value is given as multiple of minimal Time quanta.
         */
        uint32_t ssp_offset:8;
        /** ssp_src : R/W; bitpos: [25:24]; default: 0;
         *  Source of Secondary sampling point.
         *  0b00 - SSP_SRC_MEAS_N_OFFSET - SSP position = TRV_DELAY (Measured Transmitter
         *  delay) + SSP_OFFSET.
         *  0b01 - SSP_SRC_NO_SSP - SSP is not used. Transmitter uses regular Sampling Point
         *  during data bit rate.
         *  0b10 - SSP_SRC_OFFSET - SSP position = SSP_OFFSET. Measured Transmitter delay value
         *  is ignored.
         */
        uint32_t ssp_src:2;
        uint32_t reserved_26:6;
    };
    uint32_t val;
} twaifd_trv_delay_ssp_cfg_reg_t;

/** Type of timer_clk_en register
 *  TWAIFD timer clock force enable register.
 */
typedef union {
    struct {
        /** clk_en : R/W; bitpos: [0]; default: 0;
         *  Set this bit to force enable TWAIFD register configuration clock signal.
         */
        uint32_t clk_en:1;
        /** force_rxbuf_mem_clk_on : R/W; bitpos: [1]; default: 0;
         *  Set this bit to force enable TWAIFD RX buffer ram clock signal.
         */
        uint32_t force_rxbuf_mem_clk_on:1;
        uint32_t reserved_2:30;
    };
    uint32_t val;
} twaifd_timer_clk_en_reg_t;

/** Type of timer_int_raw register
 *  TWAIFD raw interrupt register.
 */
typedef union {
    struct {
        /** timer_overflow_int_raw : R/SS/WTC; bitpos: [0]; default: 0;
         *  The raw bit signal for read_done interrupt.
         */
        uint32_t timer_overflow_int_raw:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} twaifd_timer_int_raw_reg_t;

/** Type of timer_int_st register
 *  TWAIFD interrupt status register.
 */
typedef union {
    struct {
        /** timer_overflow_int_st : RO; bitpos: [0]; default: 0;
         *  The status signal for read_done interrupt.
         */
        uint32_t timer_overflow_int_st:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} twaifd_timer_int_st_reg_t;

/** Type of timer_int_ena register
 *  TWAIFD interrupt enable register.
 */
typedef union {
    struct {
        /** timer_overflow_int_ena : R/W; bitpos: [0]; default: 0;
         *  The enable signal for read_done interrupt.
         */
        uint32_t timer_overflow_int_ena:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} twaifd_timer_int_ena_reg_t;

/** Type of timer_int_clr register
 *  TWAIFD interrupt clear register.
 */
typedef union {
    struct {
        /** timer_overflow_int_clr : WT; bitpos: [0]; default: 0;
         *  The clear signal for read_done interrupt.
         */
        uint32_t timer_overflow_int_clr:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} twaifd_timer_int_clr_reg_t;

/** Type of timer_cfg register
 *  TWAI FD timer configure register.
 */
typedef union {
    struct {
        /** timer_ce : R/W; bitpos: [0]; default: 0;
         *  TWAI FD timer enable register.
         *  1b0: Not enable
         *  1b1: Enable timer
         */
        uint32_t timer_ce:1;
        /** timer_clr : WT; bitpos: [1]; default: 0;
         *  TWAI FD timer clear register.
         *  1b0: Not enable
         *  1b1: Enable to clear value
         */
        uint32_t timer_clr:1;
        /** timer_set : WT; bitpos: [2]; default: 0;
         *  TWAI FD timer set register.
         *  1b0: Not enable
         *  1b1: Enable to set value to ld_val.
         */
        uint32_t timer_set:1;
        uint32_t reserved_3:5;
        /** timer_up_dn : R/W; bitpos: [8]; default: 1;
         *  TWAI FD timer up/down count register.
         *  1b0: Count-down
         *  1b1: Count-up
         */
        uint32_t timer_up_dn:1;
        uint32_t reserved_9:7;
        /** timer_step : R/W; bitpos: [31:16]; default: 0;
         *  TWAI FD timer count step register, step=reg_timer_step+1
         */
        uint32_t timer_step:16;
    };
    uint32_t val;
} twaifd_timer_cfg_reg_t;

/** Type of timer_ld_val_l register
 *  TWAI FD timer pre-load value low register.
 */
typedef union {
    struct {
        /** timer_ld_val_l : R/W; bitpos: [31:0]; default: 0;
         *  TWAI FD timer count pre-load value register, low part.
         */
        uint32_t timer_ld_val_l:32;
    };
    uint32_t val;
} twaifd_timer_ld_val_l_reg_t;

/** Type of timer_ld_val_h register
 *  TWAI FD timer pre-load value high register.
 */
typedef union {
    struct {
        /** timer_ld_val_h : R/W; bitpos: [31:0]; default: 0;
         *  TWAI FD timer pre-load value register, high part.
         *  If timestamp valid bit-width less than 33, this field is ignored.
         */
        uint32_t timer_ld_val_h:32;
    };
    uint32_t val;
} twaifd_timer_ld_val_h_reg_t;

/** Type of timer_ct_val_l register
 *  TWAI FD timer count-to value low register.
 */
typedef union {
    struct {
        /** timer_ct_val_l : R/W; bitpos: [31:0]; default: 4294967295;
         *  TWAI FD timer count-to value register, low part.
         */
        uint32_t timer_ct_val_l:32;
    };
    uint32_t val;
} twaifd_timer_ct_val_l_reg_t;

/** Type of timer_ct_val_h register
 *  TWAI FD timer count-to value high register.
 */
typedef union {
    struct {
        /** timer_ct_val_h : R/W; bitpos: [31:0]; default: 4294967295;
         *  TWAI FD timer count-to value register, high part.
         *  If timestamp valid bit-width less than 33, this field is ignored.
         */
        uint32_t timer_ct_val_h:32;
    };
    uint32_t val;
} twaifd_timer_ct_val_h_reg_t;


/** Group: Status register */
/** Type of status register
 *  TWAI FD status register
 */
typedef union {
    struct {
        /** rxne : RO; bitpos: [0]; default: 0;
         *  RX buffer not empty. This bit is 1 when least one frame is stored in RX buffer.
         *  0: empty
         *  1: not empty
         */
        uint32_t rxne:1;
        /** dor : RO; bitpos: [1]; default: 0;
         *  Data Overrun flag. This bit is set when frame was dropped due to lack of space in
         *  RX buffer. This bit can be
         *  cleared by COMMAND[RRB].
         *  0: not overrun
         *  1: overrun
         */
        uint32_t dor:1;
        /** txnf : RO; bitpos: [2]; default: 1;
         *  TXT buffers status. This bit is set if at least one TXT buffer is in "Empty" state.
         *  0: not full
         *  1: full
         */
        uint32_t txnf:1;
        /** eft : RO; bitpos: [3]; default: 0;
         *  Error frame is being transmitted at the moment.
         *  0: not being transmitted
         *  1: being transmitted
         */
        uint32_t eft:1;
        /** rxs : RO; bitpos: [4]; default: 0;
         *  CAN FD is receiver of CAN Frame.
         *  0: not receiving
         *  1: receiving
         */
        uint32_t rxs:1;
        /** txs : RO; bitpos: [5]; default: 0;
         *  CAN FD is transmitter of CAN Frame.
         *  0: not transmitting
         *  1: transmitting
         */
        uint32_t txs:1;
        /** ewl : RO; bitpos: [6]; default: 0;
         *  TX Error counter (TEC) or RX Error counter (REC) is equal to, or higher than Error
         *  warning limit (EWL).
         *  0: not reached
         *  1: reached
         */
        uint32_t ewl:1;
        /** idle : RO; bitpos: [7]; default: 1;
         *  Bus is idle (no frame is being transmitted/received) or CAN FD is bus-off.
         *  0: active
         *  1: not active
         */
        uint32_t idle:1;
        /** pexs : RO; bitpos: [8]; default: 0;
         *  Protocol exception status (flag). Set when Protocol exception occurs. Cleared by
         *  writing COMMAND[CPEXS]=1.
         */
        uint32_t pexs:1;
        /** rxpe : RO; bitpos: [9]; default: 0;
         *  Set when parity error is detected during read of CAN frame from RX Buffer via
         *  RX_DATA register.
         */
        uint32_t rxpe:1;
        /** txpe : RO; bitpos: [10]; default: 0;
         *  TXT Buffers Parity Error flag. Set When Parity Error is detected in a TXT Buffer
         *  during transmission from this
         *  Buffer.
         */
        uint32_t txpe:1;
        /** txdpe : RO; bitpos: [11]; default: 0;
         *  TXT Buffer double parity error. Set in TXT Buffer Backup mode when parity error is
         *  detected in "backup"
         *  TXT Buffer.
         */
        uint32_t txdpe:1;
        uint32_t reserved_12:4;
        /** stcnt : RO; bitpos: [16]; default: 1;
         *  Support of Traffic counters. When this bit is 1, Traffic counters are present.
         */
        uint32_t stcnt:1;
        /** strgs : RO; bitpos: [17]; default: 1;
         *  Support of Test Registers for memory testability. When this bit is 1, Test
         *  Registers are present.
         */
        uint32_t strgs:1;
        /** sprt : RO; bitpos: [18]; default: 1;
         *  Support of Parity protection on each word of TXT Buffer RAM and RX Buffer RAM.
         */
        uint32_t sprt:1;
        uint32_t reserved_19:13;
    };
    uint32_t val;
} twaifd_status_reg_t;

