espressif/esp-idf/components/soc/esp32h4/register/soc/twaifd_struct.h
/** Type of int_mask_clr register
 *  TWAI FD interrupt mask clear register
 */
typedef union {
    struct {
        /** rxi_int_mask_clr : WO; bitpos: [0]; default: 0;
         *  Write 1 to clear TWAIFD_RXI_INT_MASK_CLR .
         */
        uint32_t rxi_int_mask_clr:1;
        /** txi_int_mask_clr : WO; bitpos: [1]; default: 0;
         *  Write 1 to clear TWAIFD_TXI_INT_MASK_CLR .
         */
        uint32_t txi_int_mask_clr:1;
        /** ewli_int_mask_clr : WO; bitpos: [2]; default: 0;
         *  Write 1 to clear TWAIFD_EWLI_INT_MASK_CLR .
         */
        uint32_t ewli_int_mask_clr:1;
        /** doi_int_mask_clr : WO; bitpos: [3]; default: 0;
         *  Write 1 to clear TWAIFD_DOI_INT_MASK_CLR .
         */
        uint32_t doi_int_mask_clr:1;
        /** fcsi_int_mask_clr : WO; bitpos: [4]; default: 0;
         *  Write 1 to clear TWAIFD_FCSI_INT_MASK_CLR .
         */
        uint32_t fcsi_int_mask_clr:1;
        /** ali_int_mask_clr : WO; bitpos: [5]; default: 0;
         *  Write 1 to clear TWAIFD_ALI_INT_MASK_CLR .
         */
        uint32_t ali_int_mask_clr:1;
        /** bei_int_mask_clr : WO; bitpos: [6]; default: 0;
         *  Write 1 to clear TWAIFD_BEI_INT_MASK_CLR .
         */
        uint32_t bei_int_mask_clr:1;
        /** ofi_int_mask_clr : WO; bitpos: [7]; default: 0;
         *  Write 1 to clear TWAIFD_OFI_INT_MASK_CLR .
         */
        uint32_t ofi_int_mask_clr:1;
        /** rxfi_int_mask_clr : WO; bitpos: [8]; default: 0;
         *  Write 1 to clear TWAIFD_RXFI_INT_MASK_CLR .
         */
        uint32_t rxfi_int_mask_clr:1;
        /** bsi_int_mask_clr : WO; bitpos: [9]; default: 0;
         *  Write 1 to clear TWAIFD_BSI_INT_MASK_CLR .
         */
        uint32_t bsi_int_mask_clr:1;
        /** rbnei_int_mask_clr : WO; bitpos: [10]; default: 0;
         *  Write 1 to clear TWAIFD_RBNEI_INT_MASK_CLR .
         */
        uint32_t rbnei_int_mask_clr:1;
        /** txbhci_int_mask_clr : WO; bitpos: [11]; default: 0;
         *  Write 1 to clear TWAIFD_TXBHCI_INT_MASK_CLR .
         */
        uint32_t txbhci_int_mask_clr:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} twaifd_int_mask_clr_reg_t;


/** Group: error confinement register */
/** Type of ewl_erp_fault_state register
 *  TWAI FD error threshold and status register
 */
typedef union {
    struct {
        /** ew_limit : R/W; bitpos: [7:0]; default: 96;
         *  Error warning limit. If error warning limit is reached interrupt can be generated.
         *  Error warning limit
         *  indicates heavily disturbed bus.
         */
        uint32_t ew_limit:8;
        /** erp_limit : R/W; bitpos: [15:8]; default: 128;
         *  Error Passive Limit. When one of error counters (REC/TEC) exceeds this value, Fault
         *  confinement state
         *  changes to error-passive.
         */
        uint32_t erp_limit:8;
        /** era : RO; bitpos: [16]; default: 0;
         *  Represents the fault state of error active.
         */
        uint32_t era:1;
        /** erp : RO; bitpos: [17]; default: 0;
         *  Represents the fault state of error passive.
         */
        uint32_t erp:1;
        /** bof : RO; bitpos: [18]; default: 1;
         *  Represents the fault state of bus off.
         */
        uint32_t bof:1;
        uint32_t reserved_19:13;
    };
    uint32_t val;
} twaifd_ewl_erp_fault_state_reg_t;

/** Type of rec_tec register
 *  TWAI FD error counters status register
 */
typedef union {
    struct {
        /** rec_val : RO; bitpos: [8:0]; default: 0;
         *  Represents the receiver error counter value.
         */
        uint32_t rec_val:9;
        uint32_t reserved_9:7;
        /** tec_val : RO; bitpos: [24:16]; default: 0;
         *  Represents the transmitter error counter value.
         */
        uint32_t tec_val:9;
        uint32_t reserved_25:7;
    };
    uint32_t val;
} twaifd_rec_tec_reg_t;

/** Type of err_norm_err_fd register
 *  TWAI FD special error counters status register
 */
typedef union {
    struct {
        /** err_norm_val : RO; bitpos: [15:0]; default: 0;
         *  Represents the number of error in the nominal bit time.
         */
        uint32_t err_norm_val:16;
        /** err_fd_val : RO; bitpos: [31:16]; default: 0;
         *  Represents the number of error in the data bit time.
         */
        uint32_t err_fd_val:16;
    };
    uint32_t val;
} twaifd_err_norm_err_fd_reg_t;

/** Type of ctr_pres register
 *  TWAI FD error counters pre-define configuration register
 */
typedef union {
    struct {
        /** ctpv : WO; bitpos: [8:0]; default: 0;
         *  Configures the pre-defined value to set the error counter.
         */
        uint32_t ctpv:9;
        /** ptx : WT; bitpos: [9]; default: 0;
         *  Configures whether or not to set the receiver error counter into the value of
         *  pre-defined value.
         *  0: invalid
         *  1: set
         */
        uint32_t ptx:1;
        /** prx : WT; bitpos: [10]; default: 0;
         *  Configures whether or not to set the transmitter error counter into the value of
         *  pre-defined value.
         *  0: invalid
         *  1: set
         */
        uint32_t prx:1;
        /** enorm : WO; bitpos: [11]; default: 0;
         *  Configures whether or not to erase the error counter of nominal bit time.
         *  0: invalid
         *  1: erase
         */
        uint32_t enorm:1;
        /** efd : WO; bitpos: [12]; default: 0;
         *  Configures whether or not to erase the error counter of data bit time.
         *  0: invalid
         *  1: erase
         */
        uint32_t efd:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} twaifd_ctr_pres_reg_t;


/** Group: filter register */
/** Type of filter_mask register
 *  TWAI FD filter mask value register
 */
typedef union {
    struct {
        /** bit_mask_val : R/W; bitpos: [28:0]; default: 0;
         *  Filter mask. The identifier format is the same as in IDENTIFIER_W of TXT buffer
         *  or RX
         *  buffer. If filter is not present, writes to this register have no effect and read
         *  will return all zeroes.
         */
        uint32_t bit_mask_val:29;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} twaifd_filter_mask_reg_t;

/** Type of filter_val register
 *  TWAI FD filter bit value register
 */
typedef union {
    struct {
        /** bit_val : R/W; bitpos: [28:0]; default: 0;
         *  Filter value. The identifier format is the same as in IDENTIFIER_W of TXT buffer
         *  or RX buffer.
         *  If filter is not present, writes to this register have no effect and read will
         *  return all zeroes.
         */
        uint32_t bit_val:29;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} twaifd_filter_val_reg_t;

/** Type of filter_ran_low register
 *  TWAI FD filter range low value register
 */
typedef union {
    struct {
        /** bit_ran_low_val : R/W; bitpos: [28:0]; default: 0;
         *  Filter Range Low threshold. The identifier format is the same as in IDENTIFIER_W of
         *  TXT
         *  buffer or RX buffer. If Range filter is not supported, writes to this register have
         *  no effect and read will return all
         *  Zeroes.
         */
        uint32_t bit_ran_low_val:29;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} twaifd_filter_ran_low_reg_t;

/** Type of filter_ran_high register
 *  TWAI FD filter range high value register
 */
typedef union {
    struct {
        /** bit_ran_high_val : R/W; bitpos: [28:0]; default: 0;
         *  Range filter High threshold. The identifier format is the same as in IDENTIFIER_W
         *  of TXT
         *  buffer or RX buffer. If Range filter is not supported, writes to this register have
         *  no effect and read will return all
         *  Zeroes.
         */
        uint32_t bit_ran_high_val:29;
        uint32_t reserved_29:3;
    };
    uint32_t val;
} twaifd_filter_ran_high_reg_t;

/** Type of filter_control_filter_status register
 *  TWAI FD filter control register
 */
typedef union {
    struct {
        /** fanb : R/W; bitpos: [0]; default: 1;
         *  CAN Basic Frame is accepted by filter A.
         */
        uint32_t fanb:1;
        /** fane : R/W; bitpos: [1]; default: 1;
         *  CAN Extended Frame is accepted by Filter A.
         */
        uint32_t fane:1;
        /** fafb : R/W; bitpos: [2]; default: 1;
         *  CAN FD Basic Frame is accepted by filter A.
         */
        uint32_t fafb:1;
        /** fafe : R/W; bitpos: [3]; default: 1;
         *  CAN FD Extended Frame is accepted by filter A.
         */
        uint32_t fafe:1;
        /** fbnb : R/W; bitpos: [4]; default: 0;
         *  CAN Basic Frame is accepted by filter B.
         */
        uint32_t fbnb:1;
        /** fbne : R/W; bitpos: [5]; default: 0;
         *  CAN Extended Frame is accepted by Filter B.
         */
        uint32_t fbne:1;
        /** fbfb : R/W; bitpos: [6]; default: 0;
         *  CAN FD Basic Frame is accepted by filter B.
         */
        uint32_t fbfb:1;
        /** fbfe : R/W; bitpos: [7]; default: 0;
         *  CAN FD Extended Frame is accepted by filter B.
         */
        uint32_t fbfe:1;
        /** fcnb : R/W; bitpos: [8]; default: 0;
         *  CAN Basic Frame is accepted by filter C.
         */
        uint32_t fcnb:1;
        /** fcne : R/W; bitpos: [9]; default: 0;
         *  CAN Extended Frame is accepted by Filter C.
         */
        uint32_t fcne:1;
        /** fcfb : R/W; bitpos: [10]; default: 0;
         *  CAN FD Basic Frame is accepted by filter C.
         */
        uint32_t fcfb:1;
        /** fcfe : R/W; bitpos: [11]; default: 0;
         *  CAN FD Extended Frame is accepted by filter C.
         */
        uint32_t fcfe:1;
        /** frnb : R/W; bitpos: [12]; default: 0;
         *  CAN Basic Frame is accepted by Range filter.
         */
        uint32_t frnb:1;
        /** frne : R/W; bitpos: [13]; default: 0;
         *  CAN Extended Frame is accepted by Range filter.
         */
        uint32_t frne:1;
        /** frfb : R/W; bitpos: [14]; default: 0;
         *  CAN FD Basic Frame is accepted by Range filter.
         */
        uint32_t frfb:1;
        /** frfe : R/W; bitpos: [15]; default: 0;
         *  CAN FD Extended Frame is accepted by Range filter.
         */
        uint32_t frfe:1;
        /** sfa : RO; bitpos: [16]; default: 1;
         *  Logic 1 when Filter A is available. Otherwise logic 0.
         */
        uint32_t sfa:1;
        /** sfb : RO; bitpos: [17]; default: 1;
         *  Logic 1 when Filter B is available. Otherwise logic 0.
         */
        uint32_t sfb:1;
        /** sfc : RO; bitpos: [18]; default: 1;
         *  Logic 1 when Filter C is available. Otherwise logic 0.
         */
        uint32_t sfc:1;
        /** sfr : RO; bitpos: [19]; default: 1;
         *  Logic 1 when Range Filter is available. Otherwise logic 0.
         */
        uint32_t sfr:1;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} twaifd_filter_control_filter_status_reg_t;


/** Group: receiver register */
/** Type of rx_data register
 *  TWAI FD received data register
 */
typedef union {
    struct {
        /** rx_data : RO; bitpos: [31:0]; default: 0;
         *  RX buffer data at read pointer position in FIFO. By reading from this register,
         *  read pointer is auto-
         *  matically increased, as long as there is next data word stored in RX buffer. First
         *  stored word in the buffer is
         *  FRAME_FORMAT_W, next IDENTIFIER_W etc. This register shall be read by 32 bit access.
         */
        uint32_t rx_data:32;
    };
    uint32_t val;
} twaifd_rx_data_reg_t;


/** Group: transmitter register */
/** Type of tx_command_txtb_info register
 *  TWAI FD TXT buffer command & information register
 */
typedef union {
    struct {
        /** txce : WO; bitpos: [0]; default: 0;
         *  Issues "set empty" command.
         */
        uint32_t txce:1;
        /** txcr : WO; bitpos: [1]; default: 0;
         *  Issues "set ready" command.
         */
        uint32_t txcr:1;
        /** txca : WO; bitpos: [2]; default: 0;
         *  Issues "set abort" command.
         */
        uint32_t txca:1;
        uint32_t reserved_3:5;
        /** txb1 : WO; bitpos: [8]; default: 0;
         *  Command is issued to TXT Buffer 1.
         */
        uint32_t txb1:1;
        /** txb2 : WO; bitpos: [9]; default: 0;
         *  Command is issued to TXT Buffer 2.
         */
        uint32_t txb2:1;
        /** txb3 : WO; bitpos: [10]; default: 0;
         *  Command is issued to TXT Buffer 3. If number of TXT Buffers is less than 3, this
         *  field is reserved and has no
         *  Function.
         */
        uint32_t txb3:1;
        /** txb4 : WO; bitpos: [11]; default: 0;
         *  Command is issued to TXT Buffer 4. If number of TXT Buffers is less than 4, this
         *  field is reserved and has no
         *  Function.
         */
        uint32_t txb4:1;
        /** txb5 : WO; bitpos: [12]; default: 0;
         *  Command is issued to TXT Buffer 5. If number of TXT Buffers is less than 5, this
         *  field is reserved and has no
         *  Function.
         */
        uint32_t txb5:1;
        /** txb6 : WO; bitpos: [13]; default: 0;
         *  Command is issued to TXT Buffer 6. If number of TXT Buffers is less than 6, this
         *  field is reserved and has no
         *  Function.
         */
        uint32_t txb6:1;
        /** txb7 : WO; bitpos: [14]; default: 0;
         *  Command is issued to TXT Buffer 7. If number of TXT Buffers is less than 7, this
         *  field is reserved and has no
         *  Function.
         */
        uint32_t txb7:1;
        /** txb8 : WO; bitpos: [15]; default: 0;
         *  Command is issued to TXT Buffer 8. If number of TXT Buffers is less than 8, this
         *  field is reserved and has no
         *  Function.
         */
        uint32_t txb8:1;
        /** txt_buffer_count : RO; bitpos: [19:16]; default: 4;
         *  Number of TXT buffers present in CAN FD. Lowest buffer is always 1. Highest
         *  buffer
         *  is at index equal to number of present buffers.
         */
        uint32_t txt_buffer_count:4;
        uint32_t reserved_20:12;
    };
    uint32_t val;
} twaifd_tx_command_txtb_info_reg_t;

/** Type of tx_priority register
 *  TWAI FD TXT buffer command & information register
 */
typedef union {
    struct {
        /** txt1p : R/W; bitpos: [2:0]; default: 1;
         *  Priority of TXT buffer 1.
         */
        uint32_t txt1p:3;
        uint32_t reserved_3:1;
        /** txt2p : R/W; bitpos: [6:4]; default: 0;
         *  Priority of TXT buffer 2.
         */
        uint32_t txt2p:3;
        uint32_t reserved_7:1;
        /** txt3p : R/W; bitpos: [10:8]; default: 0;
         *  Priority of TXT buffer 3. If number of TXT Buffers is less than 3, this field is
         *  reserved and has no function.
         */
        uint32_t txt3p:3;
        uint32_t reserved_11:1;
        /** txt4p : R/W; bitpos: [14:12]; default: 0;
         *  Priority of TXT buffer 4. If number of TXT Buffers is less than 4, this field is
         *  reserved and has no function.
         */
        uint32_t txt4p:3;
        uint32_t reserved_15:1;
        /** txt5p : R/W; bitpos: [18:16]; default: 0;
         *  Priority of TXT buffer 5. If number of TXT Buffers is less than 5, this field is
         *  reserved and has no function.
         */
        uint32_t txt5p:3;
        uint32_t reserved_19:1;
        /** txt6p : R/W; bitpos: [22:20]; default: 0;
         *  Priority of TXT buffer 6. If number of TXT Buffers is less than 6, this field is
         *  reserved and has no function.
         */
        uint32_t txt6p:3;
        uint32_t reserved_23:1;
        /** txt7p : R/W; bitpos: [26:24]; default: 0;
         *  Priority of TXT buffer 7. If number of TXT Buffers is less than 7, this field is
         *  reserved and has no function.
         */
        uint32_t txt7p:3;
        uint32_t reserved_27:1;
        /** txt8p : R/W; bitpos: [30:28]; default: 0;
         *  Priority of TXT buffer 8. If number of TXT Buffers is less than 8, this field is
         *  reserved and has no function.
         */
        uint32_t txt8p:3;
        uint32_t reserved_31:1;
    };
    uint32_t val;
} twaifd_tx_priority_reg_t;


/** Group: controller register */
/** Type of rx_fr_ctr register
 *  TWAI FD received frame counter register
 */
typedef union {
    struct {
        /** rx_fr_ctr_val : RO; bitpos: [31:0]; default: 0;
         *  Number of received frames by CAN FD.
         */
        uint32_t rx_fr_ctr_val:32;
    };
    uint32_t val;
} twaifd_rx_fr_ctr_reg_t;

/** Type of tx_fr_ctr register
 *  TWAI FD transmitted frame counter register
 */
typedef union {
    struct {
        /** tx_ctr_val : RO; bitpos: [31:0]; default: 0;
         *  Number of transmitted frames by CAN FD.
         */
        uint32_t tx_ctr_val:32;
    };
    uint32_t val;
} twaifd_tx_fr_ctr_reg_t;

/** Type of debug register
 *  TWAI FD debug register
 */
typedef union {
    struct {
        /** stuff_count : RO; bitpos: [2:0]; default: 0;
         *  Actual stuff count modulo 8 as defined in ISO FD protocol. Stuff count is erased
         *  in the beginning
         *  of CAN frame and increased by one with each stuff bit until Stuff count field in
         *  ISO FD frame. Then it stays fixed
         *  until the beginning of next frame. In non-ISO FD or normal CAN stuff bits are
         *  counted until the end of a frame.
         *  Note that this field is NOT gray encoded as defined in ISO FD standard. Stuff count
         *  is calculated only as long as
         *  controller is transceiving on the bus. During the reception this value remains
         *  fixed!
         */
        uint32_t stuff_count:3;
        /** destuff_count : RO; bitpos: [5:3]; default: 0;
         *  Actual de-stuff count modulo 8 as defined in ISO FD protocol. De-Stuff count is
         *  erased in the
         *  beginning of the frame and increased by one with each de-stuffed bit until Stuff
         *  count field in ISO FD Frame. Then
         *  it stays fixed until beginning of next frame. In non-ISO FD or normal CAN de-stuff
         *  bits are counted until the end
         *  of the frame. Note that this field is NOT grey encoded as defined in ISO FD
         *  standard. De-stuff count is calculated
         *  in both. Transceiver as well as receiver.
         */
        uint32_t destuff_count:3;
        /** pc_arb : RO; bitpos: [6]; default: 0;
         *  Protocol control state machine is in Arbitration field.
         */
        uint32_t pc_arb:1;
        /** pc_con : RO; bitpos: [7]; default: 0;
         *  Protocol control state machine is in Control field.
         */
        uint32_t pc_con:1;
        /** pc_dat : RO; bitpos: [8]; default: 0;
         *  Protocol control state machine is in Data field.
         */
        uint32_t pc_dat:1;
        /** pc_stc : RO; bitpos: [9]; default: 0;
         *  Protocol control state machine is in Stuff Count field.
         */
        uint32_t pc_stc:1;
        /** pc_crc : RO; bitpos: [10]; default: 0;
         *  Protocol control state machine is in CRC field.
         */
        uint32_t pc_crc:1;
        /** pc_crcd : RO; bitpos: [11]; default: 0;
         *  Protocol control state machine is in CRC Delimiter field.
         */
        uint32_t pc_crcd:1;
        /** pc_ack : RO; bitpos: [12]; default: 0;
         *  Protocol control state machine is in ACK field.
         */
        uint32_t pc_ack:1;
        /** pc_ackd : RO; bitpos: [13]; default: 0;
         *  Protocol control state machine is in ACK Delimiter field.
         */
        uint32_t pc_ackd:1;
        /** pc_eof : RO; bitpos: [14]; default: 0;
         *  Protocol control state machine is in End of file field.
         */
        uint32_t pc_eof:1;
        /** pc_int : RO; bitpos: [15]; default: 0;
         *  Protocol control state machine is in Intermission field.
         */
        uint32_t pc_int:1;
        /** pc_susp : RO; bitpos: [16]; default: 0;
         *  Protocol control state machine is in Suspend transmission field.
         */
        uint32_t pc_susp:1;
        /** pc_ovr : RO; bitpos: [17]; default: 0;
         *  Protocol control state machine is in Overload field.
         */
        uint32_t pc_ovr:1;
        /** pc_sof : RO; bitpos: [18]; default: 0;
         *  Protocol control state machine is in Start of frame field.
         */
        uint32_t pc_sof:1;
        uint32_t reserved_19:13;
    };
    uint32_t val;
} twaifd_debug_reg_t;


/** Group: version register */
/** Type of date_ver register
 *  TWAI FD date version
 */
typedef union {
    struct {
        /** date_ver : R/W; bitpos: [31:0]; default: 36774224;
         *  TWAI FD version
         */
        uint32_t date_ver:32;
    };
    uint32_t val;
} twaifd_date_ver_reg_t;

